<template>
	<client-only>
		<el-dialog class="policy" v-model="dialogVisible" width="640px" align-center append-to-body>
		<div class="policy-content">
			<p>Телефоны: +7 (391) 228-71-01</p>
			<p><strong>Реквизиты:</strong></p>
			<p>ИП Фамилия Имя Отчество</p>
			<p>ИНН 243407680070</p>
			<p>ОГРНИП 316545450057771</p>
			<p>
				Юридический адрес: 660134, г. Красноярск, ул. 10 мая, 40 - оф. Texas Meat House (правое крыло)
			</p>
			<p>Телефоны: +7 (391) 228-71-01</p>
			<h3>ОПИСАНИЕ СФЕРЫ ДЕЯТЕЛЬНОСТИ</h3>
			<p>Доставка готовых блюд японской, тайской, корейской и китайской кухни</p>
			<h2>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ И ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h2>
			<p>
				Политика конфиденциальности СУШИСЕЛЛ.РФ: предоставляет пользователям сайта следующие гарантии:
			</p>
			<ul>
				<li>неразглашение персональных данных и их безопасность;</li>
				<li>
					использование сведений, предоставленных пользователем, исключительно с целью связи с ним,
					в том числе для направления электронных уведомлений.
				</li>
			</ul>
			<p>
				Основное условие политики конфиденциальности СУШИСЕЛЛ.РФ максимальная прозрачность. Ваши
				персональные данные защищены и обработаны, согласно ФЗ РФ №152 “О персональных данных”.
			</p>
			<p>
				Совершая заказ на сайте СУШИСЕЛЛ.РФ Вы соглашаетесь на обработку своих персональных данных и
				обязуетесь оплатить заказ при получении.
			</p>
			<h2>СПОСОБЫ ОПЛАТЫ</h2>
			<p><strong>Наличный расчёт</strong></p>
			<p>
				Если товар доставляется курьером, то оплата осуществляется наличными курьеру в руки. При
				получении товара обязательно проверьте комплектацию заказа, наличие чека.
			</p>
			<p><strong>Банковской картой</strong></p>
			<p>
				Для выбора оплаты товара с помощью банковской карты на соответствующей странице необходимо
				нажать кнопку «Оплатить сейчас» после оформления заказа. Оплата происходит через ПАО СБЕРБАНК
				с использованием Банковских карт следующих платежных систем:
			</p>
			<h2>ВОЗВРАТ СРЕДСТВ</h2>
			<p>
				Возможен только при посещении нашего офиса с паспортом и банковской картой. Возврат
				переведенных средств, производится на Ваш банковский счет в течение 5—30 рабочих дней (срок
				зависит от Банка, который выдал Вашу банковскую карту).
			</p>
			<h2>УСЛОВИЯ ДОСТАВКИ ТОВАРА</h2>
			<p>Доставка осуществляется по городу Красноярску с 10:30 до 23:30.</p>
			<br />
			<h2>ОПИСАНИЕ ПРОЦЕССА ОПЛАТЫ КАРТОЙ</h2>
			<p>
				Для оплаты (ввода реквизитов Вашей карты] Вы будете перенаправлены на платежный шлюз ПАО
				СБЕРБАНК. Соединение с платежным шлюзом и передача информации осуществляется в защищенном
				режиме с использованием протокола шифрования SSL. В случае если Ваш банк поддерживает
				технологию безопасного проведения интернет-платежей Verified By Visa или MasterCard SecureCode
				для проведения платежа также может потребоваться ввод специального пароля. Шлюз ПАО СБЕРБАНК
				поддерживает 256-битное шифрование. Конфиденциальность сообщаемой персональной информации
				обеспечивается ПАО СБЕРБАНК. Введенная информация не будет предоставлена третьим лицам за
				исключением случаев, предусмотренных законодательством РФ. Проведение платежей по банковским
				картам осуществляется в строгом соответствии с требованиями платежных систем МИР, Visa Int. и
				MasterCard Europe Sprl. Списание средств злоумышленниками исключен.
			</p>
		</div>

		<template #footer>
			<span class="modal-footer">
				<el-button color="#00ac4e" @click="dialogVisible = false"> Закрыть </el-button>
			</span>
		</template>
	</el-dialog>
	</client-only>
</template>
<script setup>
const dialogVisible = ref(false);

function show() {
	dialogVisible.value = true;
}

defineExpose({
	show,
});
</script>
<style lang="scss">
.el-dialog.policy {
	.el-dialog__header {
		padding: 0 !important;
	}
}
.policy-content {
	color: #000;
	
	p {
		font-size: 16px;
		line-height: 1.4;
		font-weight: 400;
		margin-bottom: 13px;
		strong {
			font-weight: 700;
		}
	}
	h3 {
		font-size: 25px;
		margin-bottom: 20px;
		text-transform: uppercase;
		font-weight: 500;
	}
	h2 {
		font-weight: 500;
		font-size: 28px;
		line-height: 40px;
		margin-bottom: 24px;
		text-transform: uppercase;
	}
	ul {
		padding-left: 40px;
		li {
			list-style: disc;
			font-weight: 400;
			font-size: 14px;
			line-height: 30px;
		}
	}
}

.modal-footer button:first-child {
	margin-right: 10px;
}
</style>
